## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4fda91659fe6d8754d7bf26afc1c8f01-6" -> "c40c7d17e155ef4c733e5547292df79d"
      ~ id                     = "graphql.e408146bfeb3b9547e8ec75cd2f1e1a4.zip" -> (known after apply)
      ~ key                    = "graphql.e408146bfeb3b9547e8ec75cd2f1e1a4.zip" -> "graphql.c40c7d17e155ef4c733e5547292df79d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "./../api/dist/zipballs/graphql.zip" -> "/home/runner/work/cpf-reporter/cpf-reporter/api/dist/zipballs/graphql.zip"
      ~ source_hash            = "e408146bfeb3b9547e8ec75cd2f1e1a4" -> "c40c7d17e155ef4c733e5547292df79d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "sj6I2.lNHSoW.lHVkAUE5R1GeQRtAGZ0" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a3398d11d3218c26e0658d4f7b58b604" -> "3ade5b41e447103e712aee68fecb7b4f"
        id                     = "dist/200.html"
      ~ source                 = "./../web/dist/200.html" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/200.html"
      ~ source_hash            = "a3398d11d3218c26e0658d4f7b58b604" -> "3ade5b41e447103e712aee68fecb7b4f"
        tags                   = {}
      ~ version_id             = "R.uI4Ge_p5Aloo.SyYdACFimyN3eEZUV" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "ddf902f53d848e3da774f14325656506" -> "999fd0cad3768878fa5e5a2506c75d14"
        id                     = "dist/build-manifest.json"
      ~ source                 = "./../web/dist/build-manifest.json" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/build-manifest.json"
      ~ source_hash            = "ddf902f53d848e3da774f14325656506" -> "999fd0cad3768878fa5e5a2506c75d14"
        tags                   = {}
      ~ version_id             = "dBjJGKd5AOIajXXQQIzQGBIMDQUCihde" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7883262ca02bd1a4cdb7f5e7ba4ed71c" -> "89fac5b7a79f20270991a44c6bcb0ed1"
        id                     = "dist/chunk-references.json"
      ~ source                 = "./../web/dist/chunk-references.json" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/chunk-references.json"
      ~ source_hash            = "7883262ca02bd1a4cdb7f5e7ba4ed71c" -> "89fac5b7a79f20270991a44c6bcb0ed1"
        tags                   = {}
      ~ version_id             = "FUjTlkafqu68zbeVuBdyLSkKsehSLOQF" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["favicon.png"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/favicon.png"
      ~ source                 = "./../web/dist/favicon.png" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/favicon.png"
        tags                   = {}
      ~ version_id             = "fx9Dw17D_fHtjnpOY_InHgpua8KhLmww" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a3398d11d3218c26e0658d4f7b58b604" -> "3ade5b41e447103e712aee68fecb7b4f"
        id                     = "dist/index.html"
      ~ source                 = "./../web/dist/index.html" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/index.html"
      ~ source_hash            = "a3398d11d3218c26e0658d4f7b58b604" -> "3ade5b41e447103e712aee68fecb7b4f"
        tags                   = {}
      ~ version_id             = "8CBsxTWWoU1VVO2SytGJqn5z..hAvz.Q" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["robots.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/robots.txt"
      ~ source                 = "./../web/dist/robots.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/robots.txt"
        tags                   = {}
      ~ version_id             = "WB__0nw35SRrG6as64p6RV7o01Y9k5B0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/css/app.eb724d08.css"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/css/app.eb724d08.css"
      ~ source                 = "./../web/dist/static/css/app.eb724d08.css" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/css/app.eb724d08.css"
        tags                   = {}
      ~ version_id             = "FHmuLSE73PfsHkAllFvteb_CXU9ygeRG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/358.abc86593.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/358.abc86593.chunk.js"
      ~ source                 = "./../web/dist/static/js/358.abc86593.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/358.abc86593.chunk.js"
        tags                   = {}
      ~ version_id             = "utCQFvd0w.RcDlcUyLVEuImIDha6WxlH" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/358.abc86593.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/358.abc86593.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/358.abc86593.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/358.abc86593.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "BO1R.M61xakGx5OnvS510dsijMD1RVFo" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/390.ded542e6.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/390.ded542e6.chunk.js"
      ~ source                 = "./../web/dist/static/js/390.ded542e6.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/390.ded542e6.chunk.js"
        tags                   = {}
      ~ version_id             = "ZnmDR5MeW9Ir4pb_F5zHA_zMtdX8E5pC" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/390.ded542e6.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/390.ded542e6.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/390.ded542e6.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/390.ded542e6.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "xTtRomyu.Le20S8bDfPYL.2qsQ1e1Y4B" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/477.2ba1adfc.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/477.2ba1adfc.chunk.js"
      ~ source                 = "./../web/dist/static/js/477.2ba1adfc.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/477.2ba1adfc.chunk.js"
        tags                   = {}
      ~ version_id             = "IvFK0WyjTUDoFJwoUNchRRAESnjV.uqD" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/477.2ba1adfc.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/477.2ba1adfc.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "7yjMqiD0cZ99phr8clKnpv2w3L0dDw7s" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.5bfc4332.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js"
      ~ source                 = "./../web/dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js"
        tags                   = {}
      ~ version_id             = "WfDrxJseSPlteG6rfwZSkM8nfwIhfynj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.5bfc4332.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.5bfc4332.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "mizrKhbRbSCggGeUIpXlZKMJT.cn5j5n" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.d7739b59.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js"
      ~ source                 = "./../web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js"
        tags                   = {}
      ~ version_id             = "lPj1ZmDC9_u84hlNHxAihlLvd1BOT7Fm" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgencyPage.d7739b59.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "aOX2aymAZ48CMFD5ur50lUyuf9LWzUPj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.623680c4.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js"
      ~ source                 = "./../web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js"
        tags                   = {}
      ~ version_id             = "R.q2HwCZhX5N1PJunW.zLpJ6uhwzrMk_" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.623680c4.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = ".F9.Kp1QDRROWkt_eBjLSO2t3BYZ7qao" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.94015f7b.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js"
      ~ source                 = "./../web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js"
        tags                   = {}
      ~ version_id             = "R1ghxOVwyK9TZskd0paeIUwaxSgr6MOv" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.94015f7b.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "lFFcLUcqpDuQgkIr66zLrcPIoCyA2h2e" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/DashboardPage.65df384e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d51a209d3dda1374ec51edf60a3539d4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/DashboardPage.65df384e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/DashboardPage.65df384e.chunk.js"
+       source_hash            = "d51a209d3dda1374ec51edf60a3539d4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/DashboardPage.65df384e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "f12b962e5d7f6bbeb37d57e43c8633a1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/DashboardPage.65df384e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/DashboardPage.65df384e.chunk.js.LICENSE.txt"
+       source_hash            = "f12b962e5d7f6bbeb37d57e43c8633a1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "a6b36db5d237305f365a2ae2e9565ba9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js"
+       source_hash            = "a6b36db5d237305f365a2ae2e9565ba9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "0cb98b03c5f49de681bca973ccc95978"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"
+       source_hash            = "0cb98b03c5f49de681bca973ccc95978"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/NotFoundPage.fd8a8c88.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/NotFoundPage.fd8a8c88.chunk.js"
      ~ source                 = "./../web/dist/static/js/NotFoundPage.fd8a8c88.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/NotFoundPage.fd8a8c88.chunk.js"
        tags                   = {}
      ~ version_id             = "WCE.Oz1QQL6siCVQeVbVcnFq9kKwrZNG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/NotFoundPage.fd8a8c88.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/NotFoundPage.fd8a8c88.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/NotFoundPage.fd8a8c88.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/NotFoundPage.fd8a8c88.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "ePi98kOLLY90EsvNx5NnNPOOLIifc7sm" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js"
      ~ source                 = "./../web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js"
        tags                   = {}
      ~ version_id             = "P5UdeOT7eJCiMeTLYHxq54Urpdmsc5rX" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationEditOrganizationPage.46c7d494.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "8EkJmRKFY6xJoqUFV3FSiwRV2KsIgSt8" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js"
      ~ source                 = "./../web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js"
        tags                   = {}
      ~ version_id             = "LavK0exroB0.qyjgWW_TbH1i.KZC5cWj" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationNewOrganizationPage.053edd4c.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "CHPD8d_ocFhLfSP1JvPTQPCEttMVUqPW" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationPage.4fda6393.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js"
      ~ source                 = "./../web/dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js"
        tags                   = {}
      ~ version_id             = "iltsGfwqSBQqzwDRHwY5R3YuDHPfyGJx" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationPage.4fda6393.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationPage.4fda6393.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "ZqM5OP.Ki5DoFVznMVJkEwHuBP0cGX_D" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.c09accec.chunk.js"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js"
      ~ source                 = "./../web/dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js"
        tags                   = {}
      ~ version_id             = "wVw7E9S2a7IP7o6R3MALA6qgf9ruASaq" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.c09accec.chunk.js.LICENSE.txt"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
        id                     = "dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js.LICENSE.txt"
      ~ source                 = "./../web/dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js.LICENSE.txt" -> "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.c09accec.chunk.js.LICENSE.txt"
        tags                   = {}
      ~ version_id             = "gUUo7uyXCc4g.B5XODnom5BRqUIBz167" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.214247df.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "22aa876c53fed1fb76e64727463e9270"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.214247df.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.214247df.js"
+       source_hash            = "22aa876c53fed1fb76e64727463e9270"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.214247df.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "267a37034b5db8178e244788c7c44e2a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.214247df.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.214247df.js.LICENSE.txt"
+       source_hash            = "267a37034b5db8178e244788c7c44e2a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ac863b8.js"] will be destroyed
  # (because key ["static/js/app.7ac863b8.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "8791de0e6644ae2438232e2999fd88db" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7ac863b8.js" -> null
-       key                    = "dist/static/js/app.7ac863b8.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "./../web/dist/static/js/app.7ac863b8.js" -> null
-       source_hash            = "8791de0e6644ae2438232e2999fd88db" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "MEGgcN.k_gg8__M5sCu4hMD1B38vQari" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7ac863b8.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.7ac863b8.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "06940a9aab784938d8e0d53a11e0886f" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "./../web/dist/static/js/app.7ac863b8.js.LICENSE.txt" -> null
-       source_hash            = "06940a9aab784938d8e0d53a11e0886f" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "iCWpiuDDex0UsDxZbDKEK0kmwUrdV9Hr" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.29fe59d2.js"] will be destroyed
  # (because key ["static/js/runtime-app.29fe59d2.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "66ac9cb1d76edbf486166c876fbbc171" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.29fe59d2.js" -> null
-       key                    = "dist/static/js/runtime-app.29fe59d2.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "./../web/dist/static/js/runtime-app.29fe59d2.js" -> null
-       source_hash            = "66ac9cb1d76edbf486166c876fbbc171" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "bko7_Fd8x89..ZYAooBgBfujhkyCGKE1" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.96918d42.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "e3659d4786df4163ba1a636376b48b37"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.96918d42.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.96918d42.js"
+       source_hash            = "e3659d4786df4163ba1a636376b48b37"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ handler                        = "/opt/nodejs/node_modules/datadog-lambda-js/handler.handler" -> "graphql.handler"
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-07T20:42:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:16" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:16/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.e408146bfeb3b9547e8ec75cd2f1e1a4.zip" -> "graphql.c40c7d17e155ef4c733e5547292df79d.zip"
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DATABASE_URL"                       = (sensitive value)
              ~ "DD_CAPTURE_LAMBDA_PAYLOAD"          = "true" -> "false"
-               "DD_COMMIT_SHA"                      = "" -> null
-               "DD_GIT_REPOSITORY_URL"              = "github.com/usdigitalresponse/cpf-reporter" -> null
-               "DD_LAMBDA_HANDLER"                  = "graphql.handler" -> null
              ~ "DD_TAGS"                            = "git.commit.sha:,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:73243dd633164963ea4c348d6650c2419077b987,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "ebd6ae2ac58b579cb6ef92038317cfeb0bd61b73" -> "73243dd633164963ea4c348d6650c2419077b987"
                # (11 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "16" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 32 to change, 5 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7134110039)*